x1 = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20} #создаем список
x2 = {10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30} #создаем список
x3 = {1, 2, 3, 4, 5, 6, 7, 8, 9 , 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21} #создаем список
y = set((x1 | x2) & (x1 | x3) ^ (x2 | x3)) #формула по условию set - множество
print (x1) #выводим список x1
y1 = set() #содаем пустое множество
for a in y:
    if a % 4 == 0: #если a : 4 и получилось 0 тогда...
        y1.add(a) #добавляем в пустое множество данные
print(y1) #выводим